[
  {
    "page_num": 1,
    "text": "MATHEMATICS\nTextbook for Class X\nReprint 2025-26",
    "width": 504.0,
    "height": 720.0,
    "is_scanned": true,
    "ocr_applied": false,
    "ocr_confidence": 0.0
  },
  {
    "page_num": 2,
    "text": "1062 – M ATHEMATICS\nISBN 81-7450-634-9\nTextbook for Class X\nFirst Edition ALL RIGHTS RESERVED\nDecember 2006 Pausa 1928 q No part of this publication may be reproduced, stored in a retrieval system or\ntransmitted, in any form or by any means, electronic, mechanical, photocopying,\nReprinted recording or otherwise without the prior permission of the publisher.\nOctober 2007, January 2009, q This book is sold subject to the condition that it shall not, by way of trade, be\nDecember 2009, November 2010, lent, re-sold, hired out or otherwise disposed of without the publisher’s\nconsent, in any form of binding or cover other than that in which it is published.\nJanuary 2012, November 2012,\nq The correct price of this publication is the price printed on this page, Any\nNovember 2013, November 2014,\nrevised price indicated by a rubber stamp or by a sticker or by any other means\nDecember 2015, December 2016, is incorrect and should be unacceptable.\nDecember 2017, January 2019,\nAugust 2019, January 2021 and OFFICES OF THE PUBLICATION DIVISION, NCERT\nNovember 2021 NCERT Campus\nSri Aurobindo Marg\nNew Delhi 110 016 Phone : 011-26562708\nRevised Edition\n108, 100 Feet Road\nOctober 2022, Ashwina 1944\nHosdakere Halli Extension\nReprinted Banashankari III Stage\nMarch 2024 Chaitra 1946 Bengaluru 560 085 Phone : 080-26725740\nJune 2024 Jyeshtha 1946\nNavjivan Trust Building\nDecember 2024 Agrahayana 1946 P.O.Navjivan\nAhmedabad 380 014 Phone : 079-27541446\nPD 225T GS\nCWC Campus\nOpp. Dhankal Bus Stop\nPanihati\n©National Council of Educational\nKolkata 700 114 Phone : 033-25530454\nResearch and Training, 2006,2022\nCWC Complex\nMaligaon\nGuwahati 781 021 Phone : 0361-2674869\nPublication Team\n` 125.00 Head, Publication : M.V. Srinivasan\nDivision\nChief Editor : Bijnan Sutar\nChief Production : Jahan Lal\nOfficer (In charge)\nPrinted on 80 GSM paper with NCERT\nChief Business : Amitabh Kumar\nwatermark\nManager\nPublished at the Publication Division by Production Officer : Sunil Sharma\nthe Secretary, National Council of\nEducational Research and Training,\nIllustrations\nSri Aurobindo Marg, New Delhi 110 016\nJoel Gill and Arvinder Chawla\nand printed at Raj Printers, A-9, Sector\nCover\nB-2, Tronica City, Loni, Ghaziabad\nArvinder Chawla\n(U.P.) 201102\nReprint 2025-26",
    "width": 504.0,
    "height": 720.0,
    "is_scanned": false,
    "ocr_applied": false,
    "ocr_confidence": 0.0
  },
  {
    "page_num": 3,
    "text": "Foreword\nThe National Curriculum Framework 2005, recommends that children’s life at school\nmust be linked to their life outside the school. This principle marks a departure from\nthe legacy of bookish learning which continues to shape our system and causes a\ngap between the school, home and community. The syllabi and textbooks developed\non the basis of NCF signify an attempt to implement this basic idea. They also\nattempt to discourage rote learning and the maintenance of sharp boundaries between\ndifferent subject areas. We hope these measures will take us significantly further in\nthe direction of a child-centred system of education outlined in the National Policy\non Education (1986).\nThe success of this effort depends on the steps that school principals and teachers\nwill take to encourage children to reflect on their own learning and to pursue\nimaginative activities and questions. We must recognise that, given space, time and\nfreedom, children generate new knowledge by engaging with the information passed\non to them by adults. Treating the prescribed textbook as the sole basis of examination\nis one of the key reasons why other resources and sites of learning are ignored.\nInculcating creativity and initiative is possible if we perceive and treat children as\nparticipants in learning, not as receivers of a fixed body of knowledge.\nThese aims imply considerable change in school routines and mode of functioning.\nFlexibility in the daily time-table is as necessary as rigour in implementing the annual\ncalendar so that the required number of teaching days are actually devoted to teaching.\nThe methods used for teaching and evaluation will also determine how effective this\ntextbook proves for making children’s life at school a happy experience, rather than\na source of stress or boredom. Syllabus designers have tried to address the problem\nof curricular burden by restructuring and reorienting knowledge at different stages\nwith greater consideration for child psychology and the time available for teaching.\nThe textbook attempts to enhance this endeavour by giving higher priority and space\nto opportunities for contemplation and wondering, discussion in small groups, and\nactivities requiring hands-on experience.\nThe National Council of Educational Research and Training (NCERT) appreciates\nthe hard work done by the textbook development committee responsible for this\nbook. We wish to thank the Chairperson of the advisory group in Science and\nMathematics, Professor J.V. Narlikar and the Chief Advisors for this book, Professor\nP. Sinclair of IGNOU, New Delhi and Professor G.P. Dikshit (Retd.) of Lucknow\nUniversity, Lucknow for guiding the work of this committee. Several teachers\nReprint 2025-26",
    "width": 504.0,
    "height": 720.0,
    "is_scanned": false,
    "ocr_applied": false,
    "ocr_confidence": 0.0
  },
  {
    "page_num": 4,
    "text": "iv\ncontributed to the development of this textbook; we are grateful to their principals\nfor making this possible. We are indebted to the institutions and organisations which\nhave generously permitted us to draw upon their resources, material and personnel.\nWe are especially grateful to the members of the National Monitoring Committee,\nappointed by the Department of Secondary and Higher Education, Ministry of Human\nResource Development under the Chairpersonship of Professor Mrinal Miri and\nProfessor G.P. Deshpande, for their valuable time and contribution. As an organisation\ncommitted to systemic reform and continuous improvement in the quality of its\nproducts, NCERT welcomes comments and suggestions which will enable us to\nundertake further revision and refinement.\nDirector\nNew Delhi National Council of Educational\n15 November 2006 Research and Training\nReprint 2025-26",
    "width": 504.0,
    "height": 720.0,
    "is_scanned": false,
    "ocr_applied": false,
    "ocr_confidence": 0.0
  },
  {
    "page_num": 5,
    "text": "Rationalisation of Content in the Textbooks\nIn view of the COVID-19 pandemic, it is imperative to reduce content load on\nstudents. The National Education Policy 2020, also emphasises reducing the content\nload and providing opportunities for experiential learning with creative mindset. In\nthis background, the NCERT has undertaken the exercise to rationalise the textbooks\nacross all classes. Learning Outcomes already developed by the NCERT across\nclasses have been taken into consideration in this exercise.\nContents of the textbooks have been rationalised in view of the following:\n• Overlapping with similar content included in other subject areas in the same\nclass\n• Similar content included in the lower or higher class in the same subject\n• Difficulty level\n• Content, which is easily accessible to students without much interventions from\nteachers and can be learned by children through self-learning or peer-learning\n• Content, which is irrelevant in the present context\nThis present edition, is a reformatted version after carrying out the changes\ngiven above.\nReprint 2025-26",
    "width": 504.0,
    "height": 720.0,
    "is_scanned": false,
    "ocr_applied": false,
    "ocr_confidence": 0.0
  },
  {
    "page_num": 6,
    "text": "Reprint 2025-26",
    "width": 504.0,
    "height": 720.0,
    "is_scanned": true,
    "ocr_applied": false,
    "ocr_confidence": 0.0
  },
  {
    "page_num": 7,
    "text": "Preface\nThrough the years, from the time of the Kothari Commission, there have been\nseveral committees looking at ways of making the school curriculum meaningful\nand enjoyable for the learners. Based on the understanding developed over the\nyears, a National Curriculum Framework (NCF) was finalised in 2005. As part of\nthis exercise, a National Focus Group on Teaching of Mathematics was formed. Its\nreport, which came in 2005, highlighted a constructivist approach to the teaching\nand learning of mathematics.\nThe essence of this approach is that children already know, and do some\nmathematics very naturally in their surroundings, before they even join school. The\nsyllabus, teaching approach, textbooks etc., should build on this knowledge in a way\nthat allows children to enjoy mathematics, and to realise that mathematics is more\nabout a way of reasoning than about mechanically applying formulae and algorithms.\nThe students and teachers need to perceive mathematics as something natural and\nlinked to the world around us. While teaching mathematics, the focus should be on\nhelping children to develop the ability to particularise and generalise, to solve and\npose meaningful problems, to look for patterns and relationships, and to apply the\nlogical thinking behind mathematical proof. And, all this in an environment that the\nchildren relate to, without overloading them.\nThis is the philosophy with which the mathematics syllabus from Class I to\nClass XII was developed, and which the textbook development committee has tried\nto realise in the present textbook. More specifically, while creating the textbook, the\nfollowing broad guidelines have been kept in mind.\nl The matter needs to be linked to what the child has studied before, and to\nher experiences.\nl The language used in the book, including that for ‘word problems’, must be\nclear, simple and unambiguous.\nl Concepts/processes should be introduced through situations from the\nchildren’s environment.\nl For each concept/process give several examples and exercises, but not of\nthe same kind. This ensures that the children use the concept/process again\nand again, but in varying contexts. Here ‘several’ should be within reason,\nnot overloading the child.\nl Encourage the children to see, and come out with, diverse solutions to\nproblems.\nReprint 2025-26",
    "width": 504.0,
    "height": 720.0,
    "is_scanned": false,
    "ocr_applied": false,
    "ocr_confidence": 0.0
  },
  {
    "page_num": 8,
    "text": "viii\nl As far as possible, give the children motivation for results used.\nl All proofs need to be given in a non-didactic manner, allowing the learner to\nsee the flow of reason. The focus should be on proofs where a short and\nclear argument reinforces mathematical thinking and reasoning.\nl Whenever possible, more than one proof is to be given.\nl Proofs and solutions need to be used as vehicles for helping the learner\ndevelop a clear and logical way of expressing her arguments.\nl All geometric constructions should be accompanied by an analysis of the\nconstruction and a proof for the steps taken to do the required construction.\nAccordingly, the children would be trained to do the same while doing\nconstructions.\nl Add such small anecdotes, pictures, cartoons and historical remarks at\nseveral places which the children would find interesting.\nl Include optional exercises for the more interested learners. These would\nnot be tested in the examinations.\nl Give answers to all exercises, and solutions/hints for those that the children\nmay require.\nl Whenever possible, propagate constitutional values.\nAs you will see while studying this textbook, these points have been kept in mind\nby the Textbook Development Committee. The book has particularly been created\nwith the view to giving children space to explore mathematics and develop the abilities\nto reason mathematically. Further, two special appendices have been given — Proofs\nin Mathematics, and Mathematical Modelling. These are placed in the book for\ninterested students to study, and are only optional reading at present. These topics\nmay be considered for inclusion in the main syllabi in due course of time.\nAs in the past, this textbook is also a team effort. However, what is unusual\nabout the team this time is that teachers from different kinds of schools have been\nan integral part at each stage of the development. We are also assuming that teachers\nwill contribute continuously to the process in the classroom by formulating examples\nand exercises contextually suited to the children in their particular classrooms. Finally,\nwe hope that teachers and learners would send comments for improving the textbook\nto the NCERT.\nPARVIN SINCLAIR\nG.P. DIKSHIT\nChief Advisors\nTextbook Development Committee\nReprint 2025-26",
    "width": 504.0,
    "height": 720.0,
    "is_scanned": false,
    "ocr_applied": false,
    "ocr_confidence": 0.0
  },
  {
    "page_num": 9,
    "text": "Textbook Development Committee\nCHAIRPERSON, ADVISORY GROUP IN SCIENCE AND MATHEMATICS\nJ.V. Narlikar, Emeritus Professor, Inter-University Centre for Astronomy & Astrophysics\n(IUCAA), Ganeshkhind, Pune University, Pune\nCHIEF ADVISORS\nP. Sinclair, Professor of Mathematics, IGNOU, New Delhi\nG.P. Dikshit, Professor (Retd.), Lucknow University, Lucknow\nCHIEF COORDINATOR\nHukum Singh, Professor and Head (Retd.), DESM, NCERT, New Delhi\nMEMBERS\nAnjali Lal, PGT, DAV Public School, Sector-14, Gurgaon\nA.K. Wazalwar, Professor and Head, DESM, NCERT\nB.S. Upadhyaya, Professor, RIE, Mysore\nJayanti Datta, PGT, Salwan Public School, Gurgaon\nMahendra Shanker, Lecturer (S.G.) (Retd.), NCERT\nManica Aggarwal, Green Park, New Delhi\nN.D. Shukla, Professor (Retd.), Lucknow University, Lucknow\nRam Avtar, Professor (Retd.) & Consultant, DESM, NCERT\nRama Balaji, TGT, K.V., MEG & Centre, St. John’s Road, Bangalore\nS. Jagdeeshan, Teacher and Member, Governing Council, Centre for Learning, Bangalore\nS.K.S. Gautam, Professor (Retd.), DESM, NCERT\nVandita Kalra, Lecturer, Sarvodaya Kanya Vidyalaya, Vikaspuri District Centre, Delhi\nV.A. Sujatha, TGT, Kendriya Vidyalaya No. 1, Vasco, Goa\nV. Madhavi, TGT, Sanskriti School, Chankyapuri, New Delhi\nMEMBER-COORDINATOR\nR.P. Maurya, Professor, DESM, NCERT, New Delhi\nReprint 2025-26",
    "width": 504.0,
    "height": 720.0,
    "is_scanned": false,
    "ocr_applied": false,
    "ocr_confidence": 0.0
  },
  {
    "page_num": 10,
    "text": "Acknowledgements\nThe Council gratefully acknowledges the valuable contributions of the following\nparticipants of the Textbook Review Workshop:\nMala Mani, TGT, Amity International School, Sector-44, Noida; Meera\nMahadevan, TGT, Atomic Energy Central School, No. 4, Anushakti Nagar, Mumbai;\nRashmi Rana, TGT, D.A.V. Public School, Pushpanjali Enclave, Pitampura, Delhi;\nMohammad Qasim, TGT, Anglo Arabic Senior Secondary School, Ajmeri Gate, Delhi;\nS.C. Rauto, TGT, Central School for Tibetans, Happy Valley, Mussoorie; Rakesh\nKaushik, TGT, Sainik School, Kunjpura, Karnal; Ashok Kumar Gupta, TGT, Jawahar\nNavodaya Vidyalaya, Dudhnoi, Distt. Goalpara; Sankar Misra, TGT, Demonstration\nMultipurpose School, RIE, Bhubaneswar; Uaday Singh, Lecturer, Department of\nMathematics, B.H.U., Varanasi; B.R. Handa, Emeritus Professor, IIT, New Delhi;\nMonika Singh, Lecturer, Sri Ram College (University of Delhi), Lajpat Nagar,\nNew Delhi; G. Sri Hari Babu, TGT, Jawahar Navodaya Vidyalaya, Sirpur, Kagaz\nNagar, Adilabad; Ajay Kumar Singh, TGT, Ramjas Sr. Secondary School No. 3,\nChandni Chowk, Delhi; Mukesh Kumar Agrawal, TGT, S.S.A.P.G.B.S.S. School,\nSector-V, Dr Ambedkar Nagar, New Delhi.\nSpecial thanks are due to Professor Hukum Singh, Head (Retd.), DESM, NCERT\nfor his support during the development of this book.\nThe Council acknowledges the efforts of Deepak Kapoor, Incharge, Computer\nStation; Purnendu Kumar Barik, Copy Editor; Naresh Kumar and Nargis Islam,\nD.T.P. Operators; Yogita Sharma, Proof Reader.\nThe Contribution of APC-Office, administration of DESM, Publication\nDepartment and Secretariat of NCERT is also duly acknowledged.\nReprint 2025-26",
    "width": 504.0,
    "height": 720.0,
    "is_scanned": false,
    "ocr_applied": false,
    "ocr_confidence": 0.0
  },
  {
    "page_num": 11,
    "text": "Contents\nForeword iii\nRationalisation of Contents in the Textbooks v\nPreface vii\n1. Real Numbers 1\n1.1 Introduction 1\n1.2 The Fundamental Theorem of Arithmetic 2\n1.3 Revisiting Irrational Numbers 6\n1.4 Summary 9\n2. Polynomials 10\n2.1 Introduction 10\n2.2 Geometrical Meaning of the Zeroes of a Polynomial 11\n2.3 Relationship between Zeroes and Coefficients of a Polynomial 18\n2.4 Summary 23\n3. Pair of Linear Equations in Two Variables 24\n3.1 Introduction 24\n3.2 Graphical Method of Solution of a Pair of Linear Equations 25\n3.3 Algebraic Methods of Solving a Pair of Linear Equations 30\n3.3.1 Substitution Method 30\n3.3.2 Elimination Method 34\n3.4 Summary 37\n4. Quadratic Equations 38\n4.1 Introduction 38\n4.2 Quadratic Equations 39\n4.3 Solution of a Quadratic Equation by Factorisation 42\n4.4 Nature of Roots 44\n4.5 Summary 47\n5. Arithmetic Progressions 49\n5.1 Introduction 49\nReprint 2025-26",
    "width": 504.0,
    "height": 720.0,
    "is_scanned": false,
    "ocr_applied": false,
    "ocr_confidence": 0.0
  },
  {
    "page_num": 12,
    "text": "xii\n5.2 Arithmetic Progressions 51\n5.3 nth Term of an AP 56\n5.4 Sum of First n Terms of an AP 63\n5.5 Summary 72\n6. Triangles 73\n6.1 Introduction 73\n6.2 Similar Figures 74\n6.3 Similarity of Triangles 79\n6.4 Criteria for Similarity of Triangles 85\n6.5 Summary 97\n7. Coordinate Geometry 99\n7.1 Introduction 99\n7.2 Distance Formula 100\n7.3 Section Formula 106\n7.4 Summary 112\n8. Introduction to Trigonometry 113\n8.1 Introduction 113\n8.2 Trigonometric Ratios 114\n8.3 Trigonometric Ratios of Some Specific Angles 121\n8.4 Trigonometric Identities 128\n8.5 Summary 132\n9. Some Applications of Trigonometry 133\n9.1 Heights and Distances 133\n9.2 Summary 143\n10. Circles 144\n10.1 Introduction 144\n10.2 Tangent to a Circle 145\n10.3 Number of Tangents from a Point on a Circle 147\n10.4 Summary 153\n11. Areas Related to Circles 154\n11.1 Areas of Sector and Segment of a Circle 154\n11.2 Summary 160\nReprint 2025-26",
    "width": 504.0,
    "height": 720.0,
    "is_scanned": false,
    "ocr_applied": false,
    "ocr_confidence": 0.0
  },
  {
    "page_num": 13,
    "text": "xiii\n12. Surface Areas and Volumes 161\n12.1 Introduction 161\n12.2 Surface Area of a Combination of Solids 162\n12.3 Volume of a Combination of Solids 167\n12.4 Summary 170\n13. Statistics 171\n13.1 Introduction 171\n13.2 Mean of Grouped Data 171\n13.3 Mode of Grouped Data 183\n13.4 Median of Grouped Data 188\n13.5 Summary 200\n14. Probability 202\n14.1 Probability — A Theoretical Approach 202\n14.2 Summary 217\nAppendix A1 : Proofs in Mathematics 218\nA1.1 Introduction 218\nA1.2 Mathematical Statements Revisited 218\nA1.3 Deductive Reasoning 221\nA1.4Conjectures, Theorems, Proofs and Mathematical Reasoning 223\nA1.5 Negation of a Statement 228\nA1.6Converse of a Statement 231\nA1.7 Proof by Contradiction 234\nA1.8 Summary 238\nAppendix A2 : Mathematical Modelling 239\nA2.1 Introduction 239\nA2.2 Stages in Mathematical Modelling 240\nA2.3 Some Illustrations 244\nA2.4 Why is Mathematical Modelling Important? 248\nA2.5 Summary 249\nAnswers/Hints 250\nReprint 2025-26",
    "width": 504.0,
    "height": 720.0,
    "is_scanned": false,
    "ocr_applied": false,
    "ocr_confidence": 0.0
  },
  {
    "page_num": 14,
    "text": "xii\nConstitution of India\nPart IV A (Article 51 A)\nFundamental Duties\nIt shall be the duty of every citizen of India —\n(a) to abide by the Constitution and respect its ideals and institutions, the\nNational Flag and the National Anthem;\n(b) to cherish and follow the noble ideals which inspired our national struggle\nfor freedom;\n(c) to uphold and protect the sovereignty, unity and integrity of India;\n(d) to defend the country and render national service when called upon to\ndo so;\n(e) to promote harmony and the spirit of common brotherhood amongst all\nthe people of India transcending religious, linguistic and regional or\nsectional diversities; to renounce practices derogatory to the dignity of\nwomen;\n(f) to value and preserve the rich heritage of our composite culture;\n(g) to protect and improve the natural environment including forests, lakes,\nrivers, wildlife and to have compassion for living creatures;\n(h) to develop the scientific temper, humanism and the spirit of inquiry and\nreform;\n(i) to safeguard public property and to abjure violence;\n(j) to strive towards excellence in all spheres of individual and collective\nactivity so that the nation constantly rises to higher levels of endeavour\nand achievement;\n*(k) who is a parent or guardian, to provide opportunities for education to\nhis child or, as the case may be, ward between the age of six and\nfourteen years.\nNote: The Article 51A containing Fundamental Duties was inserted by the Constitution\n(42nd Amendment) Act, 1976 (with effect from 3 January 1977).\n*(k) was inserted by the Constitution (86th Amendment) Act, 2002 (with effect from\n1 April 2010).\nReprint 2025-26",
    "width": 504.0,
    "height": 720.0,
    "is_scanned": false,
    "ocr_applied": false,
    "ocr_confidence": 0.0
  }
]